---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ColumnBaseAttachCutParam
source: html/13cba490-c888-97b8-6f40-0f3ed2b6f1cb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ColumnBaseAttachCutParam Property

"Base Attachment Cut"

## Syntax (C#)
```csharp
public static ForgeTypeId ColumnBaseAttachCutParam { get; }
```